<!DOCTYPE html>
<html lang="rus">
<head>
	<meta charset="UTF-8">
	<title>HDD</title>
	<link rel="stylesheet" type="text/css" href="css/style.css">
	<link rel="stylesheet" type="text/css" href="css/page-style.css">	
</head>
<body>
	<div class="page">
<?php
require('header.php');
?>

	<main class="content">
		<article class="post  single-post">
				<div class="post__entry">
	<h1>HDD</h1>
	<p>
		Накопитель на жёстких магнитных дисках, или НЖМД (англ. hard (magnetic) disk drive, <strong>HDD</strong>, HMDD), жёсткий диск, винчестер — запоминающее устройство (устройство хранения информации, накопитель) произвольного доступа, основанное на принципе магнитной записи. Является основным накопителем данных в большинстве компьютеров.
	</p>
	<h2>
		Принцип работы
	</h2>
	<p>Принцип работы жесткого диска достаточно прост. Типичный винчестер состоит из нескольких основных узлов:</p>
	<ul>
		<li>корпус из ударопрочного сплава,</li>
		<li>пластины с магнитным покрытием,</li>
		<li>блок головок с устройством для позиционирования,</li>
		<li>блок электроники,</li>
		<li>электропривод.</li>
	</ul>
	<p>
		Многие пользователи считают, что жесткие диски герметичны. Однако это не так — внутри требуется поддерживать постоянное давление при колебаниях температур. В связи с этим жесткий диск оснащен фильтром, который задерживает частицы диаметром до нескольких микрометров.
	</p>
	<img src="https://www.tadviser.ru/images/9/97/HDD.jpg" alt="HDD">
	<p>
		Блок электроники содержит собственное запоминающее устройство и несколько подблоков, которые отвечают за цифровую обработку сигнала, управление и работу с интерфейсом. Работа самого жесткого диска сильно напоминает структуру магнитофона. Рабочая поверхность диска движется с определенной скоростью относительно считывающей головки. Во время процедуры записи или чтения головки парят над поверхностью диска на воздушной подушке. Если в зазор между диском и головкой попадет пылинка, то головки могут удариться о поверхность, испортить диск и даже сгореть.
	</p>
	<p>
		Магнитный диск может быть сделан не только из металла, но и из стекла, как это было в моделях от IBM. На поверхности диска находится магнитный слой, который и служит основой для записи информации. Биты информации записываются с помощью головки, которая проходя над поверхностью вращающегося диска намагничивает миллиарды горизонтальных дискретных областей — доменов. Каждая из этих областей является логическим нулём или единицей, в зависимости от намагниченности.
	</p>
	<p>
		Изначально поверхность блина абсолютно пустая, то есть магнитные домены никак не ориентированы. Для ориентирования блока магнитных головок на магнитный диск наносятся специальные метки — серво-метки. Это осуществляется «родным» блоком магнитных головок, который управляется в свою очередь внешним устройством. После разметки жесткий диск сам в состоянии читать информацию и записывать на поверхность. При больших объемах винчестера в него устанавливается несколько магнитных дисков, которые закрепляются на шпиндельном двигателе, и образуют стопку блинов.
	</p>
				</div><!-- .post__entry -->
			</article><!-- .post -->
		</main><!-- .content -->
</div><!-- .page -->
	
</body>
</html>