<!DOCTYPE html>
<html lang="rus">
<head>
	<meta charset="UTF-8">
	<title>Перспективы</title>
	<link rel="stylesheet" type="text/css" href="css/style.css">
	<link rel="stylesheet" type="text/css" href="css/page-style.css">
</head>
<body>
	<div class="page">
	<?php
		require('header.php');
	?>
		<main class="content">
			<article class="post  single-post">
					<div class="post__entry">
						<p>
							Потребность в системах хранения данных продолжает расти, и в 2020 году, а также в последующие годы эта тенденция не изменится. Причину понять несложно: все больше организаций выбирают облачные решения вместо инвестирования в развитие собственной инфраструктуры. Появляются новые инновационные компании, которые строят свою деятельность на основе модели «всё как услуга». Растущий спрос на системы хранения обусловлен также и приложениями, которые используются, например, для анализа массивов больших данных и отработки алгоритмов искусственного интеллекта (ИИ) в огромных наборах данных.
						</p>
						<p>

							Согласно прогнозам IDC, с 2018 по 2025 год общая емкость систем хранения, поставляемых на рынок, превысит 22 зеттабайт. 26% этого объема будет обеспечена флеш-устройствами. Но доля жестких дисков будет куда выше — 59%. Учитывая растущую популярность приложений с ИИ и инновационных служб автоматизации с поддержкой нового стандарта — 5G, предприятия и операторы центров обработки данных должны рассматривать все возможные варианты их хранения. Это залог правильного инвестирования на несколько лет вперед.
						</p>
						<p>
							Нельзя отрицать привлекательности устройств хранения на основе флеш-технологий, например, твердотельных накопителей (SSD): они компактны, энергоэкономичны, отличаются низким временем задержки и высокой производительностью. Однако все эти плюсы стоят недешево — флеш-устройства обычно в 8–10 раз дороже жесткого диска с аналогичными характеристиками. И такая разница вполне оправданна, если речь идет о загрузочном устройстве для сервера или приложения уровня tier-0, так что вряд ли жесткие диски вновь займут эту нишу. Но если мы говорим о планировании, важно понять, могут ли твердотельные накопители подешеветь настолько, чтобы вытеснить жесткие диски из областей, в которых они востребованы сейчас.
						</p>
						<p>
							Последние несколько лет наблюдается снижение стоимости каждого терабайта как в отношении твердотельных накопителей, так и жестких дисков. Впрочем, подробное сравнение показывает, что снижение стоимости терабайта для обеих технологий идет в одном темпе. Это говорит о том, что в обозримом будущем твердотельники вряд ли вытеснят жесткие диски, несмотря на совершенствование технологий, поскольку те останутся более привлекательным вариантом с точки зрения стоимости.
						</p>
						<p>
							Четвертая промышленная революция, развитие «Интернета вещей» и последующая обработка данных, генерируемых устройствами приведут к росту объема передачи данных в секунду в пространстве данных. Производительность твердотельных накопителей идеально подходит для краткосрочного хранения данных «Интернета вещей». Но если говорить о долгосрочном хранении, аналитике и архивации, то здесь безоговорочно выигрывают жесткие диски и ленточные накопители — только они могут предоставить достаточную емкость.
						</p>
						<p>
							Согласно результатам исследования, проведенного компанией Toshiba, решения с большим количеством жестких дисков в конфигурации RAID10 или с программно-определяемой архитектурой для параллельных вычислений превосходят сопоставимые по цене решения на базе нескольких твердотельных накопителей по количеству операций ввода-вывода в секунду (для блоков данных размером более 64 Кбайт) и при этом обеспечивают втрое большую емкость. Таким образом, многодисковые решения с подходящей конфигурацией могут составить хорошую альтернативу твердотельникам. Центрам обработки данных нужно подумать о стратегиях хранения: какие данные следует сохранять, какие — нет, требуется ли сжатие при получении данных и т. п. Необходимо также уделять внимание стратегии удаления, 
							чтобы понимать, когда в хранящихся данных уже нет необходимости.
						</p>
						<p>
							Интересно, что в 2018 году совокупная емкость флеш-накопителей была в четыре раза меньше емкости присутствующих на рынке жестких дисков (Информационный бюллетень IDC «Эпоха данных — 2025» (Data Age 2025), ноябрь 2018 г).
						</p>
						<p>
							Открытие нового производственного подразделения, специализирующегося на флеш-технологиях, стоит порядка $9 млрд, а вывод продукции на рынок занимает от 18 до 24 месяцев. Трудно представить, что производителям флеш-памяти удастся угнаться за спросом или довести стоимость терабайта до отметки, которая сможет хоть как-то сравниться с жесткими дисками.
						</p>
						<p>
							Жесткие диски — проверенная временем технология, и любые возможные в будущем улучшения кажутся вполне закономерными, чего не скажешь о прорывах в области флеш-технологий. Одним из существенных улучшений является емкость жестких дисков. Ожидается, что самые большие на сегодняшний день жесткие диски увеличат емкость еще на 2 Тб всего через пару лет. У Toshiba есть подобный опыт: в 2017 году емкость гелиевых жестких дисков класса Nearline составляла 14 Тб, в 2019-м — 16 Тб. Использование гелия в производстве позволяет сделать пластины жестких дисков тоньше, в результате в каждом диске помещается девять пластин. Дальнейшие разработки в этой области позволят разместить в дисках до 10 пластин и довести емкость до 20 Тб и выше.
						</p>
						<p>
							Кроме того, использование гелия позволяет снизить потребление электроэнергии — немаловажный аспект в работе ЦОДов. Сегодня серверам хранения, потреблявшим киловатты энергии, требуется всего несколько сотен ватт. Современные емкостные жесткие диски с гелием потребляют в среднем на 28% меньше энергии, чем их предшественники (сравните MG07SCA на 12 Тб и MG06SCA на 10 Тб). Для оптимизации энергопотребления ЦОДов также необходимы решения для отключения неиспользуемых жестких дисков.
						</p>
						<p>
							Замена дисков емкостью 2–3 Тб на более новые устройства также позволяет снизить энергозатраты, увеличив при этом емкость при тех же вложениях. Важно упомянуть, что на сегодняшний день ежегодный объем энергопотребления ЦОДов составляет около 600 ТВт·ч, а к 2025 году может вырасти до 1360 ТВт·ч. Конечно же, никакие усовершенствования не должны влиять на надежность и среднее время безотказной работы. Напротив, эти показатели также должны стремиться к совершенству.
						</p>
						<p>
							Системы видеонаблюдения также способствуют росту спроса на системы хранения. Это одна из областей, где широко применяются технологии ИИ. Для функционирования системы видеонаблюдения требуется нечто отличное от традиционного ЦОДа: рабочая температура дисков должна быть в диапазоне 0–70 °C, а сами диски должны иметь высокие показатели безотказности и соответствующие гарантийные сроки. Системы камер, обеспечивающих потоковое видео высокого разрешения, генерируют просто огромные объемы данных. Поэтому диски, используемые для хранения таких данных, должны обеспечивать целостность видео (без пропадающих кадров) и доступ к данным для анализа приложениями ИИ и другими приложениями для работы с большими данными.
						</p>
						<p>
							Если отойти от корпоративных ЦОДов, потребители и компании малого и среднего бизнеса также сталкиваются с большими объемами данных. Это фотографии и видео, коммерческие данные и файлы крупных проектов. Гелиевые жесткие диски Toshiba серии N300 емкостью 16 Тб позволяют использовать высокоемкостные решения NAS и дома, и в офисе для резервного копирования или в качестве альтернативы облачным хранилищам. Они также обеспечивают должный уровень безопасности для пользователей, которые не хотят хранить личные данные в облаке.
						</p>
						<p>
							Можно с уверенностью сказать, что в ближайшие 5–10 лет спрос на системы хранения будет только расти. Большие данные, молодой развивающийся рынок ИИ-решений, приложения автоматизации, устройства с поддержкой 5G, разработка и вывод на рынок инновационных приложений — все это будет в значительной мере влиять на будущий спрос, поэтому о точных прогнозах говорить невозможно. Несмотря на ряд планируемых улучшений, производственный потенциал в области флеш-технологий и снижение стоимости терабайта, твердотельные накопители по-прежнему останутся дорогостоящей альтернативой на те случаи, когда их цена может быть оправдана. Все потому, что стоимость терабайта жестких дисков так же будет снижаться. Кроме того, технологии в основе жестких дисков постоянно совершенствуются. Таким образом, жесткие диски по-прежнему будут привлекательным вариантом в плане энергопотребления и их доля на рынке систем хранения останется внушительной. Благодаря показателям производительности жесткие диски смогут с успехом заменить твердотельные накопители в отдельных массивах RAID и программно-определяемых системах хранения при тех же затратах.						
						</p>
					</div><!-- .post__entry -->
				</article><!-- .post -->
			</main><!-- .content -->
	</div><!-- .page -->
</body>
</html>